package com.almahmoudApp.al_mahmoudapp.feature.tasbeeh.domain.model

object TasbeehDhikr {
    val milestones = listOf(
        "سبحان الله", // Initial (0 - 32)
        "استغفرالله", // 33 - 65
        "الحمدلله", // 66 - 98
        "الله اكبر", // 99 - 131
        "لا حول ولا قوة الا بالله", // 132 - 164
        "اللهم صلي وسلم على سيدنا محمد", // 165 - 197
        "لا اله الا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير", // 198 - 230
        "سبحان الله وبحمده سبحان الله العظيم", // 231 - 263
        "اللهم انك عفو كريم تحب العفو فاعف عنا", // 264 - 296
        "سبحان الله عدد ما كان وعدد ما يكون وعدد الحركات والسكون", // 297 - 329
        "سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته" // 330 (Finish)
    )

    const val MaxCount = 330
    const val MilestoneStep = 33
}
